asciiart-load-test.yml
config:
  target: "http://127.0.0.1:8000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
    - duration: 60
      arrivalRate: 10
      rampTo: 50
    - duration: 300
      rampTo: 50
scenarios:
  - name: Cek Fungsi Navigasi Halaman
    flow:
      - get:
          url: "/formpendaftaran"
      - get:
          url: "/about"
      - get:
          url: "/cekstatuspendaftaran"